blazemeter/bzm-ubikloadpack-vs.yml
settings:
  env:
     # A Version higher or equal to 5.0 is required
     JMETER_VERSION: "5.2.1"

execution:
- scenario: UbikLoadPack-Demo
  concurrency: 3
  hold-for: 2m
  ramp-up: 30s
  locations:
    us-east-1: 1

scenarios:
  UbikLoadPack-Demo:
    script: ulp_video_streaming_demo.jmx

modules:
  jmeter:
    force-ctg: false
    detect-plugins: true
    properties:
      # Change this for the URL of your manifest
      MANIFEST_URL: https://devstreaming-cdn.apple.com/videos/streaming/examples/bipbop_4x3/bipbop_4x3_variant.m3u8
      # Duration of video watched in seconds
      DURATION_WATCHED: 10
      jmeter.reportgenerator.report_title: UbikLoadPack Video Streaming Demo
      jmeter.reportgenerator.overall_granularity: 1000
      ULP.videostreaming.licensepath: ubik-streaming-plugin.license
      output: ${TAURUS_ARTIFACTS_DIR}/
      sample_variables: ulp_buffer_fill,ulp_lag_time,ulp_play_time,ulp_lag_ratio,ulp_lag_ratio_wo_bf,ulp_dwn_time
      jmeter.reportgenerator.graph.custom_ulp_lag_time.property.setSampleVariableName: ulp_lag_time
      jmeter.reportgenerator.graph.custom_ulp_lag_ratio.property.setSampleVariableName: ulp_lag_ratio
      jmeter.reportgenerator.graph.custom_ulp_lag_ratio.property.setContentMessage: Lag Ratio (%)
      jmeter.reportgenerator.graph.custom_ulp_buffer_fill.property.setContentMessage: Time to buffer
      jmeter.reportgenerator.graph.custom_ulp_buffer_fill.title: Buffer fill in Millis
      jmeter.reportgenerator.graph.custom_ulp_lag_ratio_wo_bf.property.setSampleVariableName: ulp_lag_ratio_wo_bf
      jmeter.reportgenerator.graph.custom_ulp_lag_ratio_wo_bf.property.setContentMessage: Lag Ratio wo Buffer fill(%)
      jmeter.reportgenerator.graph.custom_ulp_lag_ratio.classname: com.ubikingenierie.jmeter.plugin.videostreaming.graphing.ULPCustomGraphConsumer
      jmeter.reportgenerator.graph.custom_ulp_lag_ratio.property.set_granularity: ${jmeter.reportgenerator.overall_granularity}
      jmeter.reportgenerator.graph.custom_ulp_lag_time.property.set_X_Axis: Elapsed Time (granularity=${ULP.overall_granularity_sec}s)
      jmeter.reportgenerator.graph.custom_ulp_buffer_fill.property.set_X_Axis: Elapsed Time (granularity=${ULP.overall_granularity_sec}s)
      jmeter.reportgenerator.graph.custom_ulp_lag_ratio_wo_bf.classname: com.ubikingenierie.jmeter.plugin.videostreaming.graphing.ULPCustomGraphConsumer
      jmeter.reportgenerator.graph.custom_ulp_lag_time.classname: com.ubikingenierie.jmeter.plugin.videostreaming.graphing.ULPCustomGraphConsumer
      jmeter.reportgenerator.graph.custom_ulp_lag_time.property.set_Y_Axis: Lag Time (ms)
      jmeter.reportgenerator.graph.custom_ulp_buffer_fill.property.set_Y_Axis: Buffer fill Time (ms)
      jmeter.reportgenerator.graph.custom_ulp_lag_time.property.setContentMessage: Lag time
      jmeter.reportgenerator.graph.custom_ulp_buffer_fill.property.setSampleVariableName: ulp_buffer_fill
      jmeter.reportgenerator.graph.custom_ulp_lag_ratio.property.set_X_Axis: Elapsed Time (granularity=${ULP.overall_granularity_sec}s)
      jmeter.reportgenerator.graph.custom_ulp_lag_ratio_wo_bf.property.set_granularity: ${jmeter.reportgenerator.overall_granularity}
      jmeter.reportgenerator.graph.custom_ulp_lag_ratio_wo_bf.property.set_X_Axis: Elapsed Time (granularity=${ULP.overall_granularity_sec}s)
      jmeter.reportgenerator.graph.custom_ulp_lag_ratio_wo_bf.title: Lag ratio without buffer fill in percentage
      jmeter.reportgenerator.graph.custom_ulp_buffer_fill.classname: com.ubikingenierie.jmeter.plugin.videostreaming.graphing.ULPCustomGraphConsumer
      jmeter.reportgenerator.graph.custom_ulp_lag_ratio.property.set_Y_Axis: Percentage
      jmeter.reportgenerator.graph.custom_ulp_lag_time.title: Lag time in Millis
      jmeter.reportgenerator.graph.custom_ulp_lag_ratio_wo_bf.property.set_Y_Axis: Percentage
      jmeter.reportgenerator.graph.custom_ulp_buffer_fill.property.set_granularity: ${jmeter.reportgenerator.overall_granularity}
      jmeter.reportgenerator.graph.custom_ulp_lag_ratio.title: Lag ratio in percentage
      jmeter.reportgenerator.graph.custom_ulp_lag_time.property.set_granularity: ${jmeter.reportgenerator.overall_granularity}

services:
- module: shellexec
  post-process:
  - ~/.bzt/jmeter-taurus/${JMETER_VERSION}/bin/jmeter -p ~/.bzt/jmeter-taurus/${JMETER_VERSION}/bin/jmeter.properties -q ${TAURUS_ARTIFACTS_DIR}/jmeter-bzt.properties -g ${TAURUS_ARTIFACTS_DIR}/output.csv -j ${TAURUS_ARTIFACTS_DIR}/jmeter-report.log -o ${TAURUS_ARTIFACTS_DIR}/report
  - tar cvzf report.tar.gz ${TAURUS_ARTIFACTS_DIR}/report
  - rm -rf ${TAURUS_ARTIFACTS_DIR}/report